wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/Components/lsm6dsm/lsm6dsm_reg.h
int32_t lsm6dsm_aux_gy_flag_data_ready_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_aux_gy_flag_settling_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_AUX_DEN_DISABLE         = 0,
  LSM6DSM_AUX_DEN_LEVEL_LATCH     = 3,
  LSM6DSM_AUX_DEN_LEVEL_TRIG      = 2,
} lsm6dsm_lvl_ois_t;
int32_t lsm6dsm_aux_den_mode_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_lvl_ois_t val);
int32_t lsm6dsm_aux_den_mode_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_lvl_ois_t *val);

int32_t lsm6dsm_aux_drdy_on_int2_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_aux_drdy_on_int2_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_AUX_DISABLE   = 0,
  LSM6DSM_MODE_3_GY     = 1,
  LSM6DSM_MODE_4_GY_XL  = 3,
} lsm6dsm_ois_en_spi2_t;
int32_t lsm6dsm_aux_mode_set(stmdev_ctx_t *ctx, lsm6dsm_ois_en_spi2_t val);
int32_t lsm6dsm_aux_mode_get(stmdev_ctx_t *ctx, lsm6dsm_ois_en_spi2_t *val);

typedef enum {
  LSM6DSM_250dps_AUX   = 0,
  LSM6DSM_125dps_AUX   = 1,
  LSM6DSM_500dps_AUX   = 2,
  LSM6DSM_1000dps_AUX  = 4,
  LSM6DSM_2000dps_AUX  = 6,
} lsm6dsm_fs_g_ois_t;
int32_t lsm6dsm_aux_gy_full_scale_set(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_g_ois_t val);
int32_t lsm6dsm_aux_gy_full_scale_get(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_g_ois_t *val);

typedef enum {
  LSM6DSM_AUX_SPI_4_WIRE = 0,
  LSM6DSM_AUX_SPI_3_WIRE = 1,
} lsm6dsm_sim_ois_t;
int32_t lsm6dsm_aux_spi_mode_set(stmdev_ctx_t *ctx, lsm6dsm_sim_ois_t val);
int32_t lsm6dsm_aux_spi_mode_get(stmdev_ctx_t *ctx, lsm6dsm_sim_ois_t *val);

typedef enum {
  LSM6DSM_AUX_LSB_AT_LOW_ADD = 0,
  LSM6DSM_AUX_MSB_AT_LOW_ADD = 1,
} lsm6dsm_ble_ois_t;
int32_t lsm6dsm_aux_data_format_set(stmdev_ctx_t *ctx,
                                    lsm6dsm_ble_ois_t val);
int32_t lsm6dsm_aux_data_format_get(stmdev_ctx_t *ctx,
                                    lsm6dsm_ble_ois_t *val);

typedef enum {
  LSM6DSM_ENABLE_CLAMP    = 0,
  LSM6DSM_DISABLE_CLAMP   = 1,
} lsm6dsm_st_ois_clampdis_t;
int32_t lsm6dsm_aux_gy_clamp_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_st_ois_clampdis_t val);
int32_t lsm6dsm_aux_gy_clamp_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_st_ois_clampdis_t *val);

typedef enum {
  LSM6DSM_AUX_GY_DISABLE  = 0,
  LSM6DSM_AUX_GY_POS      = 1,
  LSM6DSM_AUX_GY_NEG      = 3,
} lsm6dsm_st_ois_t;
int32_t lsm6dsm_aux_gy_self_test_set(stmdev_ctx_t *ctx,
                                     lsm6dsm_st_ois_t val);
int32_t lsm6dsm_aux_gy_self_test_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_st_ois_t *val);

typedef enum {
  LSM6DSM_AUX_2g   = 0,
  LSM6DSM_AUX_16g  = 1,
  LSM6DSM_AUX_4g   = 2,
  LSM6DSM_AUX_8g   = 3,
} lsm6dsm_fs_xl_ois_t;
int32_t lsm6dsm_aux_xl_full_scale_set(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_xl_ois_t val);
int32_t lsm6dsm_aux_xl_full_scale_get(stmdev_ctx_t *ctx,
                                      lsm6dsm_fs_xl_ois_t *val);

typedef enum {
  LSM6DSM_AUX_DEN_ACTIVE_LOW   = 0,
  LSM6DSM_AUX_DEN_ACTIVE_HIGH  = 1,
} lsm6dsm_den_lh_ois_t;
int32_t lsm6dsm_aux_den_polarity_set(stmdev_ctx_t *ctx,
                                     lsm6dsm_den_lh_ois_t val);
int32_t lsm6dsm_aux_den_polarity_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_den_lh_ois_t *val);

typedef enum {
  LSM6DSM_SPI_4_WIRE  = 0,
  LSM6DSM_SPI_3_WIRE  = 1,
} lsm6dsm_sim_t;
int32_t lsm6dsm_spi_mode_set(stmdev_ctx_t *ctx, lsm6dsm_sim_t val);
int32_t lsm6dsm_spi_mode_get(stmdev_ctx_t *ctx, lsm6dsm_sim_t *val);

typedef enum {
  LSM6DSM_I2C_ENABLE   = 0,
  LSM6DSM_I2C_DISABLE  = 1,
} lsm6dsm_i2c_disable_t;
int32_t lsm6dsm_i2c_interface_set(stmdev_ctx_t *ctx,
                                  lsm6dsm_i2c_disable_t val);
int32_t lsm6dsm_i2c_interface_get(stmdev_ctx_t *ctx,
                                  lsm6dsm_i2c_disable_t *val);

typedef struct {
  uint8_t int1_drdy_xl             : 1;
  uint8_t int1_drdy_g              : 1;
  uint8_t int1_boot                : 1;
  uint8_t int1_fth                 : 1;
  uint8_t int1_fifo_ovr            : 1;
  uint8_t int1_full_flag           : 1;
  uint8_t int1_sign_mot            : 1;
  uint8_t int1_step_detector       : 1;
  uint8_t int1_timer               : 1;
  uint8_t int1_tilt                : 1;
  uint8_t int1_6d                  : 1;
  uint8_t int1_double_tap          : 1;
  uint8_t int1_ff                  : 1;
  uint8_t int1_wu                  : 1;
  uint8_t int1_single_tap          : 1;
  uint8_t int1_inact_state         : 1;
  uint8_t den_drdy_int1            : 1;
  uint8_t drdy_on_int1             : 1;
} lsm6dsm_int1_route_t;
int32_t lsm6dsm_pin_int1_route_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_int1_route_t val);
int32_t lsm6dsm_pin_int1_route_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_int1_route_t *val);

typedef struct{
  uint8_t int2_drdy_xl             : 1;
  uint8_t int2_drdy_g              : 1;
  uint8_t int2_drdy_temp           : 1;
  uint8_t int2_fth                 : 1;
  uint8_t int2_fifo_ovr            : 1;
  uint8_t int2_full_flag           : 1;
  uint8_t int2_step_count_ov       : 1;
  uint8_t int2_step_delta          : 1;
  uint8_t int2_iron                : 1;
  uint8_t int2_tilt                : 1;
  uint8_t int2_6d                  : 1;
  uint8_t int2_double_tap          : 1;
  uint8_t int2_ff                  : 1;
  uint8_t int2_wu                  : 1;
  uint8_t int2_single_tap          : 1;
  uint8_t int2_inact_state         : 1;
  uint8_t int2_wrist_tilt          : 1;
} lsm6dsm_int2_route_t;
int32_t lsm6dsm_pin_int2_route_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_int2_route_t val);
int32_t lsm6dsm_pin_int2_route_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_int2_route_t *val);

