wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/Components/lsm6dsm/lsm6dsm_reg.h
typedef enum {
  LSM6DSM_PUSH_PULL   = 0,
  LSM6DSM_OPEN_DRAIN  = 1,
} lsm6dsm_pp_od_t;
int32_t lsm6dsm_pin_mode_set(stmdev_ctx_t *ctx, lsm6dsm_pp_od_t val);
int32_t lsm6dsm_pin_mode_get(stmdev_ctx_t *ctx, lsm6dsm_pp_od_t *val);

typedef enum {
  LSM6DSM_ACTIVE_HIGH   = 0,
  LSM6DSM_ACTIVE_LOW    = 1,
} lsm6dsm_h_lactive_t;
int32_t lsm6dsm_pin_polarity_set(stmdev_ctx_t *ctx, lsm6dsm_h_lactive_t val);
int32_t lsm6dsm_pin_polarity_get(stmdev_ctx_t *ctx, lsm6dsm_h_lactive_t *val);

int32_t lsm6dsm_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_INT_PULSED   = 0,
  LSM6DSM_INT_LATCHED  = 1,
} lsm6dsm_lir_t;
int32_t lsm6dsm_int_notification_set(stmdev_ctx_t *ctx, lsm6dsm_lir_t val);
int32_t lsm6dsm_int_notification_get(stmdev_ctx_t *ctx, lsm6dsm_lir_t *val);

int32_t lsm6dsm_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_wkup_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_wkup_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_gy_sleep_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_gy_sleep_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_PROPERTY_DISABLE          = 0,
  LSM6DSM_XL_12Hz5_GY_NOT_AFFECTED  = 1,
  LSM6DSM_XL_12Hz5_GY_SLEEP         = 2,
  LSM6DSM_XL_12Hz5_GY_PD            = 3,
} lsm6dsm_inact_en_t;
int32_t lsm6dsm_act_mode_set(stmdev_ctx_t *ctx, lsm6dsm_inact_en_t val);
int32_t lsm6dsm_act_mode_get(stmdev_ctx_t *ctx, lsm6dsm_inact_en_t *val);

int32_t lsm6dsm_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_src_get(stmdev_ctx_t *ctx, lsm6dsm_tap_src_t *val);

int32_t lsm6dsm_tap_detection_on_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_detection_on_z_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_detection_on_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_detection_on_y_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_detection_on_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_detection_on_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_threshold_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_threshold_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_shock_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_shock_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_quiet_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_quiet_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tap_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tap_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_ONLY_SINGLE          = 0,
  LSM6DSM_BOTH_SINGLE_DOUBLE   = 1,
} lsm6dsm_single_double_tap_t;
int32_t lsm6dsm_tap_mode_set(stmdev_ctx_t *ctx,
                             lsm6dsm_single_double_tap_t val);
int32_t lsm6dsm_tap_mode_get(stmdev_ctx_t *ctx,
                             lsm6dsm_single_double_tap_t *val);

typedef enum {
  LSM6DSM_ODR_DIV_2_FEED      = 0,
  LSM6DSM_LPF2_FEED           = 1,
} lsm6dsm_low_pass_on_6d_t;
int32_t lsm6dsm_6d_feed_data_set(stmdev_ctx_t *ctx,
                                 lsm6dsm_low_pass_on_6d_t val);
int32_t lsm6dsm_6d_feed_data_get(stmdev_ctx_t *ctx,
                                 lsm6dsm_low_pass_on_6d_t *val);

typedef enum {
  LSM6DSM_DEG_80      = 0,
  LSM6DSM_DEG_70      = 1,
  LSM6DSM_DEG_60      = 2,
  LSM6DSM_DEG_50      = 3,
} lsm6dsm_sixd_ths_t;
int32_t lsm6dsm_6d_threshold_set(stmdev_ctx_t *ctx, lsm6dsm_sixd_ths_t val);
int32_t lsm6dsm_6d_threshold_get(stmdev_ctx_t *ctx, lsm6dsm_sixd_ths_t *val);

int32_t lsm6dsm_4d_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_4d_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_ff_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_ff_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_FF_TSH_156mg = 0,
  LSM6DSM_FF_TSH_219mg = 1,
  LSM6DSM_FF_TSH_250mg = 2,
  LSM6DSM_FF_TSH_312mg = 3,
  LSM6DSM_FF_TSH_344mg = 4,
  LSM6DSM_FF_TSH_406mg = 5,
  LSM6DSM_FF_TSH_469mg = 6,
  LSM6DSM_FF_TSH_500mg = 7,
} lsm6dsm_ff_ths_t;
int32_t lsm6dsm_ff_threshold_set(stmdev_ctx_t *ctx, lsm6dsm_ff_ths_t val);
int32_t lsm6dsm_ff_threshold_get(stmdev_ctx_t *ctx, lsm6dsm_ff_ths_t *val);

int32_t lsm6dsm_fifo_watermark_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsm_fifo_watermark_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsm_fifo_data_level_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsm_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);
int32_t lsm6dsm_fifo_over_run_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_fifo_pattern_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dsm_fifo_temp_batch_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_fifo_temp_batch_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_TRG_XL_GY_DRDY     = 0,
  LSM6DSM_TRG_STEP_DETECT    = 1,
  LSM6DSM_TRG_SH_DRDY        = 2,
} lsm6dsm_trigger_fifo_t;
int32_t lsm6dsm_fifo_write_trigger_set(stmdev_ctx_t *ctx,
                                       lsm6dsm_trigger_fifo_t val);
int32_t lsm6dsm_fifo_write_trigger_get(stmdev_ctx_t *ctx,
                                       lsm6dsm_trigger_fifo_t *val);

int32_t lsm6dsm_fifo_pedo_and_timestamp_batch_set(stmdev_ctx_t *ctx,
                                                  uint8_t val);
int32_t lsm6dsm_fifo_pedo_and_timestamp_batch_get(stmdev_ctx_t *ctx,
                                                  uint8_t *val);

typedef enum {
  LSM6DSM_FIFO_XL_DISABLE  = 0,
  LSM6DSM_FIFO_XL_NO_DEC   = 1,
  LSM6DSM_FIFO_XL_DEC_2    = 2,
  LSM6DSM_FIFO_XL_DEC_3    = 3,
  LSM6DSM_FIFO_XL_DEC_4    = 4,
  LSM6DSM_FIFO_XL_DEC_8    = 5,
  LSM6DSM_FIFO_XL_DEC_16   = 6,
  LSM6DSM_FIFO_XL_DEC_32   = 7,
} lsm6dsm_dec_fifo_xl_t;
int32_t lsm6dsm_fifo_xl_batch_set(stmdev_ctx_t *ctx,
                                  lsm6dsm_dec_fifo_xl_t val);
int32_t lsm6dsm_fifo_xl_batch_get(stmdev_ctx_t *ctx,
                                  lsm6dsm_dec_fifo_xl_t *val);

