wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/Components/lsm6dsm/lsm6dsm_reg.h
typedef enum {
  LSM6DSM_FIFO_GY_DISABLE = 0,
  LSM6DSM_FIFO_GY_NO_DEC  = 1,
  LSM6DSM_FIFO_GY_DEC_2   = 2,
  LSM6DSM_FIFO_GY_DEC_3   = 3,
  LSM6DSM_FIFO_GY_DEC_4   = 4,
  LSM6DSM_FIFO_GY_DEC_8   = 5,
  LSM6DSM_FIFO_GY_DEC_16  = 6,
  LSM6DSM_FIFO_GY_DEC_32  = 7,
} lsm6dsm_dec_fifo_gyro_t;
int32_t lsm6dsm_fifo_gy_batch_set(stmdev_ctx_t *ctx,
                                  lsm6dsm_dec_fifo_gyro_t val);
int32_t lsm6dsm_fifo_gy_batch_get(stmdev_ctx_t *ctx,
                                  lsm6dsm_dec_fifo_gyro_t *val);

typedef enum {
  LSM6DSM_FIFO_DS3_DISABLE   = 0,
  LSM6DSM_FIFO_DS3_NO_DEC    = 1,
  LSM6DSM_FIFO_DS3_DEC_2     = 2,
  LSM6DSM_FIFO_DS3_DEC_3     = 3,
  LSM6DSM_FIFO_DS3_DEC_4     = 4,
  LSM6DSM_FIFO_DS3_DEC_8     = 5,
  LSM6DSM_FIFO_DS3_DEC_16    = 6,
  LSM6DSM_FIFO_DS3_DEC_32    = 7,
} lsm6dsm_dec_ds3_fifo_t;
int32_t lsm6dsm_fifo_dataset_3_batch_set(stmdev_ctx_t *ctx,
                                         lsm6dsm_dec_ds3_fifo_t val);
int32_t lsm6dsm_fifo_dataset_3_batch_get(stmdev_ctx_t *ctx,
                                         lsm6dsm_dec_ds3_fifo_t *val);

typedef enum {
  LSM6DSM_FIFO_DS4_DISABLE  = 0,
  LSM6DSM_FIFO_DS4_NO_DEC   = 1,
  LSM6DSM_FIFO_DS4_DEC_2    = 2,
  LSM6DSM_FIFO_DS4_DEC_3    = 3,
  LSM6DSM_FIFO_DS4_DEC_4    = 4,
  LSM6DSM_FIFO_DS4_DEC_8    = 5,
  LSM6DSM_FIFO_DS4_DEC_16   = 6,
  LSM6DSM_FIFO_DS4_DEC_32   = 7,
} lsm6dsm_dec_ds4_fifo_t;
int32_t lsm6dsm_fifo_dataset_4_batch_set(stmdev_ctx_t *ctx,
                                         lsm6dsm_dec_ds4_fifo_t val);
int32_t lsm6dsm_fifo_dataset_4_batch_get(stmdev_ctx_t *ctx,
                                         lsm6dsm_dec_ds4_fifo_t *val);

int32_t lsm6dsm_fifo_xl_gy_8bit_format_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_fifo_xl_gy_8bit_format_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_fifo_stop_on_wtm_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_fifo_stop_on_wtm_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_BYPASS_MODE           = 0,
  LSM6DSM_FIFO_MODE             = 1,
  LSM6DSM_STREAM_TO_FIFO_MODE   = 3,
  LSM6DSM_BYPASS_TO_STREAM_MODE = 4,
  LSM6DSM_STREAM_MODE           = 6,
} lsm6dsm_fifo_mode_t;
int32_t lsm6dsm_fifo_mode_set(stmdev_ctx_t *ctx, lsm6dsm_fifo_mode_t val);
int32_t lsm6dsm_fifo_mode_get(stmdev_ctx_t *ctx, lsm6dsm_fifo_mode_t *val);

typedef enum {
  LSM6DSM_FIFO_DISABLE   =  0,
  LSM6DSM_FIFO_12Hz5     =  1,
  LSM6DSM_FIFO_26Hz      =  2,
  LSM6DSM_FIFO_52Hz      =  3,
  LSM6DSM_FIFO_104Hz     =  4,
  LSM6DSM_FIFO_208Hz     =  5,
  LSM6DSM_FIFO_416Hz     =  6,
  LSM6DSM_FIFO_833Hz     =  7,
  LSM6DSM_FIFO_1k66Hz    =  8,
  LSM6DSM_FIFO_3k33Hz    =  9,
  LSM6DSM_FIFO_6k66Hz    = 10,
} lsm6dsm_odr_fifo_t;
int32_t lsm6dsm_fifo_data_rate_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_odr_fifo_t val);
int32_t lsm6dsm_fifo_data_rate_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_odr_fifo_t *val);

typedef enum {
  LSM6DSM_DEN_ACT_LOW    = 0,
  LSM6DSM_DEN_ACT_HIGH   = 1,
} lsm6dsm_den_lh_t;
int32_t lsm6dsm_den_polarity_set(stmdev_ctx_t *ctx, lsm6dsm_den_lh_t val);
int32_t lsm6dsm_den_polarity_get(stmdev_ctx_t *ctx, lsm6dsm_den_lh_t *val);

typedef enum {
  LSM6DSM_DEN_DISABLE    = 0,
  LSM6DSM_LEVEL_FIFO     = 6,
  LSM6DSM_LEVEL_LETCHED  = 3,
  LSM6DSM_LEVEL_TRIGGER  = 2,
  LSM6DSM_EDGE_TRIGGER   = 4,
} lsm6dsm_den_mode_t;
int32_t lsm6dsm_den_mode_set(stmdev_ctx_t *ctx, lsm6dsm_den_mode_t val);
int32_t lsm6dsm_den_mode_get(stmdev_ctx_t *ctx, lsm6dsm_den_mode_t *val);

typedef enum {
  LSM6DSM_STAMP_IN_GY_DATA     = 0,
  LSM6DSM_STAMP_IN_XL_DATA     = 1,
  LSM6DSM_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dsm_den_xl_en_t;
int32_t lsm6dsm_den_enable_set(stmdev_ctx_t *ctx, lsm6dsm_den_xl_en_t val);
int32_t lsm6dsm_den_enable_get(stmdev_ctx_t *ctx, lsm6dsm_den_xl_en_t *val);

int32_t lsm6dsm_den_mark_axis_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_den_mark_axis_z_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_den_mark_axis_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_den_mark_axis_y_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_den_mark_axis_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_den_mark_axis_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_step_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_step_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_PEDO_AT_2g = 0,
  LSM6DSM_PEDO_AT_4g = 1,
} lsm6dsm_pedo_fs_t;
int32_t lsm6dsm_pedo_full_scale_set(stmdev_ctx_t *ctx,
                                    lsm6dsm_pedo_fs_t val);
int32_t lsm6dsm_pedo_full_scale_get(stmdev_ctx_t *ctx,
                                    lsm6dsm_pedo_fs_t *val);

int32_t lsm6dsm_pedo_debounce_steps_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_debounce_steps_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_timeout_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_pedo_timeout_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_pedo_steps_period_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_pedo_steps_period_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsm_motion_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_motion_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_motion_threshold_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_motion_threshold_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsm_tilt_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_tilt_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_wrist_tilt_sens_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_wrist_tilt_sens_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_tilt_latency_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_tilt_latency_get(stmdev_ctx_t *ctx, uint8_t *buff);

