wasp-lahis/Sensortile_Projects/Bluetooth_Communication/Scripts/SensorTile/STM32CubeFunctionPack_ALLMEMS1_V4.1.0/Drivers/BSP/Components/lsm6dsm/lsm6dsm_reg.h
int32_t lsm6dsm_tilt_threshold_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_tilt_threshold_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsm_tilt_src_set(stmdev_ctx_t *ctx,
                             lsm6dsm_a_wrist_tilt_mask_t *val);
int32_t lsm6dsm_tilt_src_get(stmdev_ctx_t *ctx,
                             lsm6dsm_a_wrist_tilt_mask_t *val);

int32_t lsm6dsm_mag_soft_iron_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_mag_soft_iron_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_mag_hard_iron_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_mag_hard_iron_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_mag_soft_iron_mat_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_mag_soft_iron_mat_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsm_mag_offset_set(stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6dsm_mag_offset_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6dsm_func_en_set(stmdev_ctx_t *ctx, uint8_t val);

int32_t lsm6dsm_sh_sync_sens_frame_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_sync_sens_frame_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_RES_RATIO_2_11  = 0,
  LSM6DSM_RES_RATIO_2_12  = 1,
  LSM6DSM_RES_RATIO_2_13  = 2,
  LSM6DSM_RES_RATIO_2_14  = 3,
} lsm6dsm_rr_t;
int32_t lsm6dsm_sh_sync_sens_ratio_set(stmdev_ctx_t *ctx, lsm6dsm_rr_t val);
int32_t lsm6dsm_sh_sync_sens_ratio_get(stmdev_ctx_t *ctx, lsm6dsm_rr_t *val);

int32_t lsm6dsm_sh_master_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_master_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_sh_pass_through_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_pass_through_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_EXT_PULL_UP       = 0,
  LSM6DSM_INTERNAL_PULL_UP  = 1,
  LSM6DSM_SH_PIN_MODE       = 2,
} lsm6dsm_pull_up_en_t;
int32_t lsm6dsm_sh_pin_mode_set(stmdev_ctx_t *ctx, lsm6dsm_pull_up_en_t val);
int32_t lsm6dsm_sh_pin_mode_get(stmdev_ctx_t *ctx, lsm6dsm_pull_up_en_t *val);

typedef enum {
  LSM6DSM_XL_GY_DRDY        = 0,
  LSM6DSM_EXT_ON_INT2_PIN   = 1,
} lsm6dsm_start_config_t;
int32_t lsm6dsm_sh_syncro_mode_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_start_config_t val);
int32_t lsm6dsm_sh_syncro_mode_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_start_config_t *val);

int32_t lsm6dsm_sh_drdy_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_drdy_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
    lsm6dsm_sensorhub1_reg_t   sh_byte_1;
    lsm6dsm_sensorhub2_reg_t   sh_byte_2;
    lsm6dsm_sensorhub3_reg_t   sh_byte_3;
    lsm6dsm_sensorhub4_reg_t   sh_byte_4;
    lsm6dsm_sensorhub5_reg_t   sh_byte_5;
    lsm6dsm_sensorhub6_reg_t   sh_byte_6;
    lsm6dsm_sensorhub7_reg_t   sh_byte_7;
    lsm6dsm_sensorhub8_reg_t   sh_byte_8;
    lsm6dsm_sensorhub9_reg_t   sh_byte_9;
    lsm6dsm_sensorhub10_reg_t  sh_byte_10;
    lsm6dsm_sensorhub11_reg_t  sh_byte_11;
    lsm6dsm_sensorhub12_reg_t  sh_byte_12;
    lsm6dsm_sensorhub13_reg_t  sh_byte_13;
    lsm6dsm_sensorhub14_reg_t  sh_byte_14;
    lsm6dsm_sensorhub15_reg_t  sh_byte_15;
    lsm6dsm_sensorhub16_reg_t  sh_byte_16;
    lsm6dsm_sensorhub17_reg_t  sh_byte_17;
    lsm6dsm_sensorhub18_reg_t  sh_byte_18;
} lsm6dsm_emb_sh_read_t;
int32_t lsm6dsm_sh_read_data_raw_get(stmdev_ctx_t *ctx,
                                     lsm6dsm_emb_sh_read_t *val);

int32_t lsm6dsm_sh_cmd_sens_sync_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_cmd_sens_sync_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsm_sh_spi_sync_error_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsm_sh_spi_sync_error_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSM_NORMAL_MODE_READ  = 0,
  LSM6DSM_SRC_MODE_READ     = 1,
} lsm6dsm_src_mode_t;
int32_t lsm6dsm_sh_cfg_slave_0_rd_mode_set(stmdev_ctx_t *ctx,
                                           lsm6dsm_src_mode_t val);
int32_t lsm6dsm_sh_cfg_slave_0_rd_mode_get(stmdev_ctx_t *ctx,
                                           lsm6dsm_src_mode_t *val);

typedef enum {
  LSM6DSM_SLV_0        = 0,
  LSM6DSM_SLV_0_1      = 1,
  LSM6DSM_SLV_0_1_2    = 2,
  LSM6DSM_SLV_0_1_2_3  = 3,
} lsm6dsm_aux_sens_on_t;
int32_t lsm6dsm_sh_num_of_dev_connected_set(stmdev_ctx_t *ctx,
                                            lsm6dsm_aux_sens_on_t val);
int32_t lsm6dsm_sh_num_of_dev_connected_get(stmdev_ctx_t *ctx,
                                            lsm6dsm_aux_sens_on_t *val);

typedef struct{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dsm_sh_cfg_write_t;
int32_t lsm6dsm_sh_cfg_write(stmdev_ctx_t *ctx, lsm6dsm_sh_cfg_write_t *val);

typedef struct{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dsm_sh_cfg_read_t;
int32_t lsm6dsm_sh_slv0_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);
int32_t lsm6dsm_sh_slv1_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);
int32_t lsm6dsm_sh_slv2_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);
int32_t lsm6dsm_sh_slv3_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6dsm_sh_cfg_read_t *val);

typedef enum {
  LSM6DSM_SL0_NO_DEC   = 0,
  LSM6DSM_SL0_DEC_2    = 1,
  LSM6DSM_SL0_DEC_4    = 2,
  LSM6DSM_SL0_DEC_8    = 3,
} lsm6dsm_slave0_rate_t;
int32_t lsm6dsm_sh_slave_0_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave0_rate_t val);
int32_t lsm6dsm_sh_slave_0_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave0_rate_t *val);

typedef enum {
  LSM6DSM_EACH_SH_CYCLE     = 0,
  LSM6DSM_ONLY_FIRST_CYCLE  = 1,
} lsm6dsm_write_once_t;
int32_t lsm6dsm_sh_write_mode_set(stmdev_ctx_t *ctx,
                                  lsm6dsm_write_once_t val);
int32_t lsm6dsm_sh_write_mode_get(stmdev_ctx_t *ctx,
                                  lsm6dsm_write_once_t *val);

typedef enum {
  LSM6DSM_SL1_NO_DEC   = 0,
  LSM6DSM_SL1_DEC_2    = 1,
  LSM6DSM_SL1_DEC_4    = 2,
  LSM6DSM_SL1_DEC_8    = 3,
} lsm6dsm_slave1_rate_t;
int32_t lsm6dsm_sh_slave_1_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave1_rate_t val);
int32_t lsm6dsm_sh_slave_1_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave1_rate_t *val);

typedef enum {
  LSM6DSM_SL2_NO_DEC  = 0,
  LSM6DSM_SL2_DEC_2   = 1,
  LSM6DSM_SL2_DEC_4   = 2,
  LSM6DSM_SL2_DEC_8   = 3,
} lsm6dsm_slave2_rate_t;
int32_t lsm6dsm_sh_slave_2_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave2_rate_t val);
int32_t lsm6dsm_sh_slave_2_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave2_rate_t *val);

typedef enum {
  LSM6DSM_SL3_NO_DEC  = 0,
  LSM6DSM_SL3_DEC_2   = 1,
  LSM6DSM_SL3_DEC_4   = 2,
  LSM6DSM_SL3_DEC_8   = 3,
} lsm6dsm_slave3_rate_t;
int32_t lsm6dsm_sh_slave_3_dec_set(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave3_rate_t val);
int32_t lsm6dsm_sh_slave_3_dec_get(stmdev_ctx_t *ctx,
                                   lsm6dsm_slave3_rate_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LSM6DSM_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
